In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {
    "도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천"],
    "연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
    "인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
    "지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권"]
}
columns = ["도시", "연도", "인구", "지역"]
df1 = pd.DataFrame(data, columns=columns)
df1
#행에 도시를
#열에 연도를 놓고보면.. 한눈에 볼 수 있을텐데..

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010   263203  수도권

In [3]:
df1.pivot("도시", "연도", "인구")

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

In [4]:

np.random.seed(0)
df2 = pd.DataFrame({
    'key1': ['A', 'A', 'B', 'B', 'A'],
    'key2': ['one', 'two', 'one', 'two', 'one'],
    'data1': [1, 2, 3, 4, 5],
    'data2': [10, 20, 30, 40, 50]
})
df2

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

In [5]:
groups = df2.groupby(df2.key1) #키1으로 A,b 그룹바이하겠다는뜻... 
groups  #이런객체이다 DataFrameGroupBy

In [6]:
groups.groups

{'A': [0, 1, 4], 'B': [2, 3]}

In [7]:
groups.sum()

      data1  data2
key1
A         8     80
B         7     70

In [8]:
df2.groupby(df2.key1).sum()

      data1  data2
key1
A         8     80
B         7     70

In [11]:

df2.groupby(df2['key1']).sum()

      data1  data2
key1
A         8     80
B         7     70

In [10]:
# 데이터1만 보고싶다?
df2.groupby(df2.key1)['data1'].sum()   
#데이터프레임을 그룹으로 바꾸고, 보고싶은건 data1이야

key1
A    8
B    7
Name: data1, dtype: int64

In [11]:
#연습문제4.7.1  위와같은 내용인데 중첩하니까 시리즈가 아닌 데이터프레임으로 나왔다
#튜플로 하고싶음.. [['data1']] 이부분이 (data1, )
df2.groupby(df2.key1)[['data1']].sum()

      data1
key1
A         8
B         7

In [12]:
df2.groupby(df2.key1)[('data1',)].sum()

      data1
key1
A         8
B         7

In [13]:
df2.groupby(df2.key1)[('data1','data2')].sum()  
# 데이터프레임 10개중 
# 2개만 꺼내고싶으면 튜플로 리스트로 [('data1','data2')

      data1  data2
key1
A         8     80
B         7     70

In [14]:
df2.groupby(df2.key1).mean()

         data1      data2
key1
A     2.666667  26.666667
B     3.500000  35.000000

In [15]:
df2.data1.groupby([df2.key1, df2.key2]).sum() 
#같은결과1)df2.data1을 그룹바이를 먼저 했다.

key1  key2
A     one     6
      two     2
B     one     3
      two     4
Name: data1, dtype: int64

In [16]:
df2.groupby([df2.key1, df2.key2])['data1'].sum() 
#같은결과2) 데이터프레임응ㄹ 전체적으로 그룹하고

key1  key2
A     one     6
      two     2
B     one     3
      two     4
Name: data1, dtype: int64

In [18]:
df1.pivot_table("인구", "도시", "연도")

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

In [19]:
df1.pivot_table("인구", "도시", "연도", margins=True, margins_name="합계")

연도       2005       2010       2015            합계
도시
부산  3512547.0  3393191.0  3448737.0  3.451492e+06
서울  9762546.0  9631482.0  9904312.0  9.766113e+06
인천        NaN   263203.0  2890451.0  1.576827e+06
합계  6637546.5  4429292.0  5414500.0  5.350809e+06

In [20]:
df1["인구"].mean()

5350808.625

In [16]:
df1.pivot_table("인구", index=["연도", "도시"])

              인구
연도   도시
2005 부산  3512547
     서울  9762546
2010 부산  3393191
     서울  9631482
     인천   263203
2015 부산  3448737
     서울  9904312
     인천  2890451